{
    "about": "Über",
    "show-less": "Weniger",
    "show-more": "Mehr",
    "story": "Das Projekt AlgeSPACE entstand in Zusammenarbeit mit einem Lehrer eines örtlichen Gymnasiums, der das Potenzial sah, das Lösen linearer Gleichungssysteme computergestützt zu lehren. Die Schülerinnen und Schüler des Lehrers hatten Schwierigkeiten, die mathematischen Konzepte hinter den verschiedenen Methoden - Gleichsetzung, Einsetzung, und Addition - zum Lösen von linearen Gleichungssystemen in zwei Unbekannten zu verstehen. Das Projekt sucht nach innovativen Ansätzen, die das konzeptionelle Verständnis der Schüler:innen fördern und die Flexibilität beim Lösen von Gleichungssystemen verbessern sollen. Der Begriff AlgeSPACE ist eine Abkürzung für 'Algebra Scaffolding with Pedagogical Agents and Concrete Examples'.",
    "usage": "Verwendung von AlgeSPACE",
    "usage-description-1": "Die Lernsoftware steht Schülerinnen und Schülern als auch Lehrkräften frei zur Verfügung, d. h., sie kann beispielsweise für den Unterricht oder daheim zum Selbstlernen verwendet werden, ohne dass ein Einverständnis zur Nutzung unsererseits notwendig ist. Das Nutzen der Seite im frei zugänglichen Programmanteil erfolgt komplett anonym, wir tracken keine Nutzerdaten.",
    "usage-description-2": "Bei Fragen oder Feedback können Sie uns gerne unter den unten genannten Kontaktinformationen erreichen.",
    "research": "Unsere Forschung",
    "concept-title": "Interaktives Scaffolding mit visuellen Darstellungen zur Förderung des konzeptionellen Lernens",
    "concept-1": "Die angebotenen Lehrbücher zum Thema lineare Gleichungssysteme führen die meisten Methoden entweder direkt formal ein oder enthalten komplizierte Visualisierungen. Um dieses Problem zu lösen, haben wir eine Lernsoftware für jede der drei genannten Strategien entwickelt. Das Design wurde von dem Unterrichtsstil des Lehrers inspiriert, der mathematische Konzepte gerne in bildhafter Sprache erklärt und Analogien zu realen Situationen herstellt. Dieser Unterrichtsstil ähnelt den Praktiken von 'Realistic Mathematics Education'¹ (RME, Realistischer Mathematikunterricht zu Deutsch).",
    "concept-2": "RME ist ein Unterrichtsansatz, der realistische und sinnvolle Problemkontexte als Ausgangspunkt für das Erlernen von Mathematik verwendet. Ein Kernkonzept von RME ist die progressive Formalisierung². Der Begriff bezieht sich auf den allmählichen Übergang vom Lernen mit informellen und kontextbezogenen Darstellungen wie Modellen zur Verwendung abstrakter mathematischer Argumente und formaler, symbolischer Sprache. Modelle sind visuelle Darstellungen von Größen und Beziehungen, die den Schüler:innen helfen, ihr informelles Wissen über die reale Welt mit abstrakten Darstellungen mathematischer Konzepte zu verbinden.",
    "concept-3": "Für jede der drei Methoden zum Lösen eines linearen Gleichungssystems haben wir ein Intelligentes Tutoring-System (ITS) entworfen, das die mathematischen Ideen hinter der jeweiligen Strategie bildlich erklären und widerspiegeln soll. Jedes ITS wurde in einen realistischen und sinnvollen Problemkontext eingebettet. Außerdem ersetzten wir die unbekannten und abstrakten Variablen in den linearen Gleichungen durch visuelle Darstellungen, die für den gegebenen Kontext relevant waren. Darüber hinaus haben wir Elemente der Gamification, wie beispielsweise Storytelling, visuelle Ästhetik und Challenges, in unser Design integriert, da diese Motivation und Lernergebnisse positiv beeinflussen können.",
    "agent-title": "Motivationales Scaffolding zur Unterstützung strategischer Lernentscheidungen",
    "agent-1": "Neben dem konzeptionellen Verständnis wird Flexibilität, d. h., das Wissen verschiedener Strategien und ihrer relativen Effizienz, als wichtiges Lernziel in diesem Bereich gesehen. Während der Covid-19-Pandemie hat sich der Lernfortschritt der Schüler:innen weltweit erheblich verlangsamt. Es wird geschätzt, dass sich allein in Deutschland die tägliche Lernzeit der Schüler:innen halbiert hat³. Eine häufig genannte Erklärung ist die mangelnde Motivation der Schüler:innen. Im Projekt AlgeSPACE haben wir ein Intelligentes Tutoring-System (ITS) zum Trainieren von Flexibilität entwickelt. In dem ITS werden pädagogische Agenten eingesetzt, die die Schüler:innen motivieren und bei strategischen Lernentscheidungen unterstützen sollen.",
    "agent-2": "Studien haben gezeigt, dass pädagogische Agenten das Lernen mit multimedialen Anwendungen erleichtern können⁴, indem die Agenten die Rollen von Motivatoren, Mentoren und Experten übernehmen können. Während die motivierenden Aspekte von pädagogischen Agenten bereits ausgiebig erforscht wurden⁵, ist die Auswirkung von pädagogischen Agenten auf das Lernverhalten der Schüler:innen weniger erforscht. Im Rahmen dieses Projekts sollen Strategien entwickelt werden, die die Lernenden dazu ermutigen, sich an freiwilligen Übungen, die kognitiv anspruchsvoll und dennoch effektiv sind, zu beteiligen. Eine solche Strategie ist die Einbeziehung von pädagogischen Agenten. Ein anderer Ansatz ist die Implementierung zusätzlicher motivierender Botschaften, die auf der Erwartung-mal-Wert-Theorie⁶ basieren.",
    "agent-3": "In unserer Lernsoftware erhalten die Schüler:innen verschiedene Aufgaben zum Lösen linearer Gleichungssysteme. Jede Aufgabe beinhaltet nicht nur das Lösen von Systemen, sondern auch eine optionale Übung, in der die Schüler:innen entweder aufgefordert werden, die Effizienz ihrer gewählten Strategie für das vorgegebene System zu begründen oder verschiedene Strategien für das selbe Probleme zu vergleichen, um die Flexibilität zu fördern. Dabei soll untersucht werden, ob das Vorhandensein von pädagogischen Agenten und zusätzlichen motivierenden Botschaften das Entscheidungsverhalten der Schüler:innen positiv beeinflussen kann.",
    "team": "Unser Team",
    "nagashima-introduction": "Die Arbeitsgemeinschaft von Prof. Dr. Tomohiro Nagashima der Fachrichtung Informatik mit Schwerpunkt Technology Enhanced Learning an der Universität des Saarlandes beschäftigt sich mit dem menschlichen Lernverhalten und entwickelt in Zusammenarbeit mit Lehrenden und Lernenden neue Lerntechnologien.",
    "bonaventura-introduction": "Die Website wurde von Katharina Bonaventura im Rahmen ihrer Masterarbeit im Fachbereich Informatik an der Universität des Saarlandes designt und implementiert. Im Rahmen der Masterarbeit von Helene Nüttgens wurde die Lernsoftware in 2025 um verschiedene Funktionalitäten erweitert. AlgeSPACE wird in diesem Leistungsumfang auch für Studien zu menschlichem Lernen an Schulen in mehreren Bundesländern eingesetzt. ",
    "students": "Studierende"
}
