{
    "post-it-title": "Deine Aufgabe",
    "post-it-system": "Betrachte das folgende lineare Gleichungssystem (LGS):",
    "post-it-task": "Löse das LGS durch Addieren und Subtrahieren der Gleichungen in den Tabellenreihen. Du kannst eine Gleichung auch mit einem konstanten Faktor multiplizieren oder dividieren.",
    "button-add-rows": "Addiere Reihen",
    "button-sub-rows": "Subtrahiere Reihen",
    "button-switch-rows": "Tauschen",
    "switch-label-images": "Zeige Bilder:",
    "switch-label-fractions": "Zeige Brüche:",
    "instr-add-or-sub-rows": "Du kannst die Reihen jederzeit addieren oder voneinander subtrahieren:",
    "instr-add-rows": "Wähle die Gleichungen, die du addieren möchtest, aus.",
    "instr-sub-rows": "Wähle die Gleichungen, die du voneinander subtrahieren möchtest, aus. Achte auf die Reihenfolge, die zweite Reihe, die du anklickst, ist immer der Subtrahend.",
    "instr-mul-rows": "Falls du die Gleichung doch nicht multiplizieren möchtest, kannst du jederzeit abbrechen:",
    "instr-div-rows": "Falls du die Gleichung doch nicht dividieren möchtest, kannst du jederzeit abbrechen:",
    "instr-max-rows": "Die maximal erlaubte Anzahl an Reihen ist erreicht. Um wieder Reihen addieren oder subtrahieren zu können, musst du zunächst eine Reihe entfernen.",
    "confirm-add-rows": "Du hast ausgewählt, dass du die {{first}}. und {{second}}. Reihe addieren möchtest:",
    "confirm-sub-rows": "Du hast ausgewählt, dass du die {{second}}. von der {{first}}. Reihe abziehen möchtest:",
    "confirm-mul-or-div": "Wie möchtest du mit der Eingabe verfahren?",
    "input-field-validation-error": "Bitte gib eine Zahl ungleich Null ein, Gleit- kommazahlen sind erlaubt. Du kannst die folgenden Zeichen benutzen, um Brüche darzustellen oder Terme vor dem $t({{action}}) zu addieren:",
    "input-field-evaluation-error": "Das ist kein gültiger Ausdruck. ",
    "input-field-range-error": "Leider ist mindestens eine der berechneten Zahlen zu groß oder zu klein, um dargestellt zu werden. Du scheinst beim Rechnen auf Abwege gekommen zu sein. Das Gleichungssystem hat eine einfachere Lösung.",
    "input-action-mul": "Multiplizieren",
    "input-action-div": "Dividieren",
    "input-field-error-instr": "Bitte korrigiere deine Eingabe oder breche die Aktion ab um zum vorherigen Zustand zurückzukehren:",
    "first-solution": "Gut gemacht, du weißt nun, wie viel {{variable}} kostest:",
    "first-solution-value": "Im letzten Schritt hast du berechnet, wie viel {{variable}} wert ist:",
    "substitution-1": "Kannst du mit dieser Information berechnen, wie viel {{variable}} kostet? In welche der beiden Gleichungen des Systems würdest du den Geldbetrag einsetzen?",
    "substitution-2": "Wähle geschickt, sodass der Rechenaufwand von Hand niedrig ist.",
    "good-choice": "Das stimmt. Der Rechenaufwand ist bei der {{count}} Gleichung vermutlich geringer.",
    "bad-choice": "Es würde dich voraussichtlich weniger Rechenaufwand kosten, die Lösung für {{variable}} in die $t({{count}}) Gleichung einzusetzen. Betrachte noch einmal beide Gleichungen genauer, um zu verstehen, warum du mit der {{count2}} Gleichung vermutlich weniger Rechenoperationen benötigen würdest.",
    "neutral-choice": "In diesem Fall wäre jede der beiden Gleichungen eine gute Wahl gewesen.",
    "system-solution-1": "Die Lösung des Systems",
    "system-solution-2": "lautet:",
    "hint-1": "Versuche so lange Zeilen zu addieren und zu subtrahieren oder mit einem konstanten Faktor zu multiplizieren oder zu dividieren, bis du den Wert einer Unbekannten ermittelt hast.",
    "hint-2": "Ziel ist es, eine Reihe zu erhalten, in der die erste Spalte eine 0 enthält und in der zweiten Spalte eine 1 steht, oder umgekehrt, denn dann ist der Wert einer Variablen bekannt.",
    "hint-3": "Versuche ein gemeinsames Vielfaches bei einer der Variablen zu erzeugen.",
    "hint-4": "Du kannst auch mit negativen Zahlen rechnen. Im aktuellen Kontext hieße das zum Beispiel, dass du Waren verkaufst, statt zu kaufen.",
    "tutorial-title": "Tutorial: Lernspiel zum Additionsverfahren",
    "tutorial-story-1": "Du bist mit deiner Familie im Urlaub in der Karibik und möchtest deinen Freunden daheim ein Präsent mitbringen. Da dein monatliches Taschengeld nicht sehr hoch ist, ist dein Budget beschränkt. Die Läden vor Ort bieten verschiedene Angebote an, wenn du Waren mehrfach kaufst und/oder untereinander kombinierst.",
    "tutorial-story-2": "Die Angebote bilden ein lineares Gleichungssystem. Kannst du aus dem System bestimmen, wie viel eine Ware einzeln kosten würde, d.h., ob sich ein Kauf für dich lohnt und ob die Angebote wirklich so günstig sind, wie sie auf den ersten Blick erscheinen? Dieses Lernspiel soll das Konzept des Additionsverfahrens vermitteln.",
    "tutorial-post-it": "Du hast dir das Angebot in Form eines Gleichungssystems auf einem Post-it notiert.",
    "tutorial-notebook": "Zum Lösen des Gleichungssystems benutzt du ein Notizbuch. Du hast gehört, dass man Gleichungssysteme tabellarisch besonders geschickt lösen kann. Das möchtest du nun auch ausprobieren. Jede Reihe in der Tabelle stellt eine Gleichung dar. In den ersten beiden Spalten einer Reihe siehst du die Anzahl an Waren, die ein Händler in Kombination verkauft. Die letzte Spalte sagt dir, wie viel du für diese Waren zusammen bezahlen würdest. Die Tabelle ist initial mit den Gleichungen aus dem System gefüllt.",
    "tutorial-add-subtract-buttons": "Mit dem Notebook kannst du die Tabellenreihen bzw. die damit dargestellten Gleichungen addieren und/oder subtrahieren. Wähle zunächst die gewünschte Aktion über den entsprechenden Button aus.",
    "tutorial-row-selection": "Anschließend kannst du Reihen per Klick oder Tippen auf diese auswählen. Möchtest du Reihen voneinander subtrahieren, so ist die zweite ausgewählte Reihe immer der Subtrahend. Die Reihenfolge spielt bei Addition zweier Reihen aber keine Rolle.",
    "tutorial-subtraction-preview": "Sobald du zwei Reihen ausgewählt hast, wird dir die Aktion unten auch bildlich mithilfe von Gleichungen angezeigt. Bist du mit deiner Auswahl nicht zufrieden, kannst du auch eine Reihe durch Klicken oder Antippen deselektieren und anschließend eine andere Reihe auswählen.",
    "tutorial-subtraction-actions": "Bist du mit deiner Auswahl zufrieden, kannst du den Button mit dem Taschenrechner-Symbol verwenden, um die Addition oder Subtraktion auszuführen. Über den Button mit dem Stop-Symbol kannst du die Aktion abbrechen. Der vorherige Stand der Tabelle wird dann wiederhergestellt. Zusätzlich gibt es im Subtraktionsmodus noch einen Button mit dem Label 'Tauschen', der die Reihenfolge der Gleichungen vertauscht.",
    "tutorial-new-row": "Addierst oder subtrahierst du zwei Reihen, wird das Ergebnis in eine neue Reihe unten drunter geschrieben. Subtraktion kann unter anderem dazu führen, dass du negative Zahlen erhältst. Das ist nicht schlimm. Die dargestellte Gleichung ist trotzdem gültig und auch die Lösung des Gleichungssystems bleibt dieselbe. Im aktuellen Kontext kannst du dir beispielsweise vorstellen, dass du Waren verkaufst, statt zu kaufen.",
    "tutorial-undo-redo-buttons": "Du kannst berechnen auch wieder rückgängig machen. Dazu findest du links unten zwei Buttons, einen zum rückgängig zu machen und einen um den rückgängig gemachten Zustand wiederherzustellen. Ist ein Button grau, heißt das, dass du die mit dem Button verbundene Aktion gerade nicht durchführen kannst.",
    "tutorial-copy-delete-buttons": "Alternativ kannst du Reihen auch löschen. Die Aktion des Löschens ist allerdings nur möglich, wenn es mindestens zwei Reihen in der Tabelle gibt. Um eine Reihe zu löschen, musst du entweder einen Rechtsklick auf diese machen oder falls du ein Gerät mit Touch verwendest, die Reihe länger gedrückt halten. In diesem Fall geht ein Menü mit den Optionen, eine Reihe zu löschen oder zu kopieren, auf.",
    "tutorial-mul-div-buttons": "Natürlich kannst du einzelne Reihen auch mit Konstanten multiplizieren oder dividieren.",
    "tutorial-mul-input": "Wählst du einer der beiden Aktionen aus, erscheint rechts neben der Tabelle ein Eingabefeld. Klicke dieses an und gebe die gewünschte Zahl ein. Es ist auch möglich, im Eingabefeld Zahlen miteinander zu verrechnen, also z.B. zu addieren und die Reihe dann mit dem Ergebnis dieser Addition zu multiplizieren oder zu dividieren.",
    "tutorial-mul-error": "Gibst du eine ungültige Eingabe ein, beispielsweise Buchstaben statt einer Zahl, wird dir eine Warnung unten angezeigt und du kannst die Reihe nicht addieren oder dividieren.",
    "tutorial-mul-valid": "Gibst du eine erlaubte Eingabe ein, so erscheint unten ein Button mit einem Taschenrechner-Symbol, mit dem du die Aktion bestätigen und die Rechnung ausführen kannst.",
    "tutorial-mul-result": "Im Vergleich zur Addition oder Subtraktion zweier Reihen wird bei Multiplikation oder Division einer Reihe mit einer Konstanten keine neue Tabellenreihe erstellt. Stattdessen wird das Ergebnis direkt in die ausgewählte Reihe eingetragen.",
    "tutorial-images-switch": "Das Spiel beinhaltet einige Hilfestellungen. Links oben siehst du zwei Switch- bzw. Toggle-Buttons. Mit dem ersten Button kannst du statt Zahlen in der Tabelle die entsprechende Summe in Form von Bildern anzeigen lassen. Achtung, das gilt nur für ganze Zahlen von 1 bis 12.",
    "tutorial-floating-points": "Es kann sein, dass du durch manche Rechnungen Gleitkommazahlen erhältst.",
    "tutorial-fractions-switch": "Der zweite Switch-Button links oben ermöglicht es dir, statt mit Gleitkommazahlen mit Brüchen zu rechnen.",
    "tutorial-hints-button": "Der Hinweis-Button gibt dir allgemeine Tipps zum Spiel.",
    "tutorial-solution": "Du hast die Lösung für eine Variable bzw. Ware berechnet, sobald in einer Reihe in der ersten Spalte die Zahl 0 steht und in der zweiten Spalte die Zahl 1, oder umgekehrt. Die Lösung wird direkt für dich markiert."
}
