{
    "sign-system": "Gleichungssystem",
    "sign-task": "Aufgabe",
    "button-continue": "Ja, weiter.",
    "button-explain": "Nein, bitte erkläre.",
    "button-adopt-weight": "Gewicht als Lösung übertragen",
    "warning-max-capacity": "Die maximale Auslastung der Waagschale wurde erreicht.",
    "input-field-validation-error": "Bitte gebe eine ganze Zahl ein. Gültige Eingaben bestehen aus den Zahlen 0-9. Des Weiteren kannst du die folgenden Zeichen benutzen, um bspw. Brüche darzustellen oder Zahlen zu multiplizieren:",
    "input-field-incorrect-input": "Leider entspricht deine Eingabe nicht der gesuchten Lösung.",
    "feedback-empty-scale": "Die Waage ist zwar im Gleichgewicht, allerdings befindest du dich nun in einer Sackgasse, da beide Variablen verschwunden sind.",
    "feedback-imbalance": "Denke daran, die Waage im Gleichgewicht zu halten.",
    "feedback-equalization-invalid-simplification": "Denke dran im ersten Schritt die Gleichungen einfach nur gleichzusetzen und sie noch nicht zu vereinfachen.",
    "feedback-equalization-invalid-balance": "Zwar ist die Waage im Gleichgewicht, allerdings hilft dir die aufgestellte Gleichung nicht weiter, wie man das Gewicht {{variable}} berechnet. Betrachte noch einmal das System genauer.",
    "feedback-equalization-isolated": "Betrachte noch einmal die Aufgabenstellung. Ziel ist es eine Gleichung ohne {{variable}} herzuleiten.",
    "feedback-simplification-required": "Die dargestellte Gleichung kann möglicherweise noch vereinfacht werden.",
    "feedback-simplification-invalid": "Die dargestellte Gleichung kann nicht durch Vereinfachen der ursprünglichen Gleichung entstehen.",
    "feedback-simplification-isolated": "Wenn du eine Gleichung vereinfachen möchtest, darfst du keine neuen Variablen hinzufügen.",
    "feedback-invalid-weight": "Das ist nicht das gesuchte Gewicht. Werfe einen genauen Blick auf das Gleichungssystem.",
    "instruction-equalization": "Schritt 1: Kannst du mithilfe der Waage unten aus dem Gleichungssystem, welches oben links dargestellt ist, eine Gleichung ableiten, in der $t({{variable}}) verwendet wird? Versuche die Waage in Balance zu halten.",
    "instruction-relation": "Das ist korrekt. Betrachte noch einmal die Waage und das ursprüngliche Gleichungssystem. Kannst du erkennen, wie beides zusammenhängt?",
    "instruction-relation-reason": "Jede der beiden Seiten der unteren Waage kann genau einer Waagschale der im Gleichungssystem abgebildeten Waagen zugeordnet werden. Die Zuordnung ist farblich markiert.",
    "instruction-simplification": "Schritt 2: Die durch die Waage dargestellte Gleichung kann noch vereinfacht werden. Vereinfache die Gleichung, sodass die Waage weiterhin in Balance ist.",
    "instruction-determining-second-variable": "Schritt 3: Du hast die Gleichung weitgehend vereinfacht. Kannst du nun ablesen, wie viel {{variable}} wiegt?",
    "instruction-determining-isolated-variable": "Schritt 4: Das stimmt, {{firstVar}} wiegt {{firstWeight}} g. Die Waage unten ist nun eine digitale Waage, die du zum Wiegen benutzen kannst. Kannst du nun das Gewicht {{secVar}} berechnen? Oben links steht noch einmal das ursprüngliche Gleichungssystem.",
    "instruction-solution": "Du hast das Gleichungssystem gelöst. Gut gemacht! Die Lösung des oben links dargestellten Gleichungssystems lautet:",
    "hint-equalization-1": "Kannst du die beiden Waagen im Bild links oben so kombinieren, dass du eine einzige Waage ohne {{variable}} erhältst?",
    "hint-equalization-2": "Fülle die Waagschale(n) mit den im Bild dargestellten Gegenständen.",
    "hint-equalization-3": "Die ursprüngliche {{firstDir}} Waagschale war oder ist bereits korrekt befüllt. Du musst nur die {{secDir}} befüllen.",
    "hint-equalization-4a": "Die {{firstDir}} Seite der Waage muss nicht verändert werden. Befülle die {{secDir}} Seite mit den Objekten, die oben links im Gleichungssystem auf der {{dirScaleImage}} Waagschale der {{count}} Waage zu sehen sind. Achte hierbei zusätzlich auf die Anzahl an {{variable}}.",
    "hint-equalization-4b": "Befülle eine Seite der unteren Waage mit den Objekten, die oben links im Gleichungssystem auf der {{dirFirstImage}} Waagschale der ersten Waage zu sehen sind und die andere Seite mit den Objekten auf der {{dirSecImage}} Waagschale der zweiten abgebildeten Waage. Achte hierbei zusätzlich auf die Anzahl an {{variable}}.",
    "hint-simplification-1": "Befindet sich auf einer der Waagschalen ein Objekt, welches auch auf der anderen Waagschale zu finden ist?",
    "hint-simplification-2a": "Entferne aus der ursprünglichen Gleichung auf beiden Seiten {{weight}} Gramm sowie {{variable}}.",
    "hint-simplification-2b": "Entferne aus der ursprünglichen Gleichung auf beiden Seiten {{weight}} Gramm.",
    "hint-simplification-2c": "Entferne aus der ursprünglichen Gleichung auf beiden Seiten {{variable}}.",
    "hint-determining-second-variable-1": "Teile das Gesamtgewicht durch die Anzahl an {{variable}}.",
    "hint-determining-second-variable-2": "Du kannst das Eingabefeld wie einen Taschenrechner verwenden, um bspw. zwei Zahlen zu dividieren.",
    "hint-determining-second-variable-3": "Teile {{firstCount}} durch {{secCount}}.",
    "hint-determining-second-variable-4": "{{firstCount}} geteilt durch {{secCount}} ist {{thirdCount}}.",
    "hint-determining-isolated-variable-1": "Betrachte das Gleichungssystem links oben noch einmal.",
    "hint-determining-isolated-variable-2": "Wie viele {{firstVar}} und/oder welche Gewichte brauchst du um das Gewicht {{secVar}} nachzustellen?",
    "tutorial-title": "Tutorial: Lernspiel zum Gleichsetzungsverfahren",
    "tutorial-story-1": "Deine Eltern haben dich um deine Unterstützung bei ihrem wöchentlichen Einkauf gebeten: Es fehlt noch das komplette, auf der Einkaufsliste vermerkte Obst und Gemüse. Daher hast du dich auf den Weg in die Obst- und Gemüseabteilung deines lokalen Supermarktes gemacht.  ",
    "tutorial-story-2": "Aber irgendetwas scheint mit der digitalen Waage des Supermarktes nicht zu stimmen; du kannst einfach kein Obst direkt wiegen. Du fragst einen Mitarbeiter um Hilfe. Laut dem Mitarbeiter funktioniert die digitale Waage nur für bestimmte Artikel. Natürlich gerade die, die du nicht besorgen musst.\n",
    "tutorial-story-3": "Der Mitarbeiter schlägt dir stattdessen vor, eine manuelle Waage zu verwenden. Aber auch das ist nicht so einfach wie gedacht, da nicht für jedes Obst und Gemüse das passende Gewicht vorhanden ist. Mit etwas Mühe hast du es geschafft, dir verschiedene Gleichungen bzw. Gewichtsverhältnisse mit den manuellen Waagen herzuleiten. Kannst du aus den daraus entstandenen Gleichungssystemen das Gewicht für einen bestimmten Artikel berechnen? ",
    "tutorial-story-4": "In diesem Spiel wirst du lernen, wie du Gleichungssysteme visuell mit manuellen Waagen lösen kannst. Dieses Wissen wird dir dabei helfen, die Grundidee des Gleichsetzungsverfahrens zum Lösen von linearen Gleichungssystemen besser zu verstehen.",
    "tutorial-instruction": "Zum Lösen eines linearen Gleichungssystems, müssen im Spiel verschiedene Unteraufgaben bearbeitet bzw. Teilschritte des Lösungsverfahrens ausgeführt werden. Rechts oben siehst du immer die zum aktuellen Schritt gehörende Aufgabenstellung.",
    "tutorial-scale": "In den meisten Arbeitsschritten wirst du mit der unten dargestellten Waage arbeiten. Die Waage besitzt zwei Waagschalen, auf denen du Objekte platzieren kannst. Die Waage reflektiert das Gewichtsverhältnis der auf beiden Waagschalen platzierten Objekte. Zusätzlich ist die Waage mit einer Anzeige ausgestattet, welche das Gewichtsverhältnis der Waagschalen als Gleichung bzw. Ungleichung ausdrückt. In manchen Aufgabenstellungen befinden sich bereits initial Gegenstände auf der Waage.",
    "tutorial-items": "Du kannst das links in den Auslagen gezeigte Obst und/oder Gemüse sowie die auf dem Regal platzierten Gewichte via Drag-and-drop auf die Waage ziehen. Beachte aber, dass es für jeden Artikel nur eine limitierte Stückzahl gibt. Des Weiteren können die Gewichte mit jeder Aufgabe variieren. Möchtest du einen Gegenstand von der Waage entfernen, so reicht es aus, diesen einfach von der Waage zu ziehen und im Raum loszulassen. Der Artikel wird automatisch wieder dem Bestand hinzugefügt.",
    "tutorial-system": "Das zu lösende Gleichungssystem ist in jedem Aufgabenschritt links oben zu sehen. Jede der beiden Gleichungen des Systems wird zusätzlich mit einer Waage visualisiert.",
    "tutorial-undo-redo-buttons": "Die beiden Buttons links unten können verwendet werden, um Aktionen, wie das Platzieren eines Gegenstandes auf der Waage, rückgängig zu machen oder den rückgängig gemachten Zustand wiederherzustellen. Ist ein Button grau, heißt das, dass du die mit dem Button verbundene Aktion gerade nicht durchführen kannst.",
    "tutorial-hints-button": "Wenn du in einem Schritt nicht weiterkommst, kannst du über den Hinweis-Button einen Tipp erhalten. Versuche möglichst ohne Hinweise, die Aufgabe zu lösen.",
    "tutorial-verify-button": "Mit dem Button neben dem Hinweis-Button kannst du deine Lösung überprüfen."
}
