{
  "button-continue": "Weiter",
  "button-verify-solution": "Lösung überprüfen",
  "button-show-solution": "Lösung anzeigen",
  "button-verify-answer": "Antwort überprüfen",
  "button-cancel": "Abbrechen",
  "button-apply": "Anwenden",
  "button-insert": "Eingeben",
  "button-next-exercise": "Nächste Aufgabe",
  "button-return": "Zurückkehren",
  "button-return-home": "Zurück",
  "button-yes": "Ja",
  "button-no": "Nein",
  "switch-on": "An",
  "switch-off": "Aus",
  "language-de": "Deutsch",
  "language-en": "Englisch",
  "about": "Über uns",
  "studies": "Studien",
  "equalization": "Gleichsetzungsverfahren",
  "substitution": "Einsetzungsverfahren",
  "bartering": "Tauschhandel",
  "elimination": "Additionsverfahren",
  "flexibility-training": "Flexibilitätstraining",
  "project-description-1": "Für Schülerinnen und Schüler ist es oft schwierig, die grundlegenden Prinzipien der drei Methoden - Gleichsetzung, Einsetzung und Addition - zum Lösen von linearen Gleichungssystemen in zwei Unbekannten zu verstehen. In vielen Lehrbüchern zu diesem Thema werden diese Methoden auf formale Weise eingeführt oder komplizierte Visualisierungen verwendet. Im Rahmen des Projekts AlgeSPACE haben wir für jede dieser Strategien ein Intelligentes Tutoring-System (ITS) entwickelt, welches die mathematischen Ideen hinter der jeweiligen Strategie bildlich und spielerisch erklärt und auf einem sinnvollen Problemkontext basiert.",
  "project-description-2": "Für Forschungszwecke haben wir ein ITS zum Trainieren von Flexibilität im Lösen von formalen linearen Gleichungssystemen entwickelt. Flexibilität kann als die Fähigkeit definiert werden, mehrere Strategien anzuwenden und zu erkennen, welche Strategien für die Lösung eines bestimmten Problems effizient oder besonders nützlich sind. In den Übungen werden die Schüler von verschiedenen pädagogischen Agenten unterstützt und haben die Wahl, zusätzliche Aufgaben, welche die Flexibilität fördern, zu lösen.",
  "equalization-info": "Was bedeutet es, wenn zwei Ausdrücke oder Terme gleich sind? In dieser Einheit lernst du, welche Idee hinter dem Gleichsetzungsverfahren steckt und wie du das Verfahren praktisch anwenden kannst - zum Lösen von linearen Gleichungssystemen oder beispielsweise beim Einkaufen im Supermarkt.",
  "header-equalization-game": "Lernspiel zum Gleichsetzungsverfahren",
  "substitution-info": "Ein Handelsspiel bringt dir bei, wie man Waren geschickt tauscht, und dient damit als ideale Vorbereitung für das Einsetzungsverfahren. Das Lernspiel zum Einsetzungsverfahren erklärt, wie man Variablen in einer Gleichung durch Ausdrücke aus einer anderen Gleichung ersetzen kann und veranschaulicht spielerisch die Idee des 'Einsetzens'.",
  "header-bartering-game": "Tauschhandelspiel",
  "header-substitution-game": "Lernspiel zum Einsetzungsverfahren",
  "elimination-info": "In dem Lernspiel zum Additionsverfahren erfährst du nicht nur, was das Verfahren eigentlich mit Addition zu tun hat und wie du die Rechengesetze der Addition und Subtraktion nutzen kannst, um unbekannte Variablen aus Gleichungen geschickt zu eliminieren, sondern auch in welcher Alltagssituation das Verfahren nützlich werden könnte.",
  "header-elimination-game": "Lernspiel zum Additionsverfahren",
  "flexibility-training-info": "Es ist nicht nur wichtig, die verschiedenen Lösungsverfahren sicher anwenden zu können, sondern auch zu verstehen, welches Verfahren für welches LGS am geeignetsten ist. Diese Aufgaben können Schülerinnen und Schülern dabei helfen, sicherer und flexibler im Anwenden des Gleichsetzungs-, Einsetzungs- und Additionsverfahrens zu werden.",
  "header-flexibility-training": "Aufgaben mit Schwerpunkt Flexibilität",
  "navigation-exercise": "Aufgabe",
  "navigation-game": "Lernspiel",
  "navigation-training": "Training",
  "exercise-completed": "Erledigt",
  "tutorial": "Tutorial",
  "tutorial-end": "Das waren alle Informationen, die du zum Lösen einer Aufgabe benötigst. Es ist nicht schlimm, wenn du dir nicht alle Informationen aus diesem Tutorial merken kannst oder manche Aktionen noch nicht ganz verstehst. Fehler sind ganz normal. Das Spiel ist so entwickelt, dass du alles ausprobieren kannst.",
  "tutorial-end-plain": "Du kannst nun zur Aufgabenübersicht zurückkehren oder mit der ersten Aufgabe starten:",
  "tutorial-end-study": "Du kannst nun zur Aufgabenübersicht zurückkehren und mit der ersten Aufgabe zum Verfahren starten:",
  "tutorial-previous-instruction": "Vorherige Instruktion",
  "tutorial-next-instruction": "Nächste Instruktion",
  "tutorial-exercise-overview": "Aufgabenübersicht",
  "tutorial-first-exercise": "Erste Aufgabe",
  "equation-1": "Gleichung 1",
  "equation-2": "Gleichung 2",
  "rotate-device": "Bitte rotiere dein Gerät.",
  "rotate-device-reason": "Das Lernspiel kann nur im Querformat gespielt werden.",
  "unsupported-device": "Leider unterstützen wir das von dir verwendete Gerät zurzeit nicht. Bitte verwende ein gängiges Tablet, einen Laptop oder Desktop.",
  "load-next-exercise": "Gut gemacht, diese Aufgabe wäre erledigt. Möchtest du mit der nächsten Aufgabe fortfahren oder zur Aufgabenübersicht zurückkehren?",
  "undefined-exercise-series": "Gut gemacht, diese Aufgabe wäre erledigt. Du kannst nun zur Aufgabenübersicht zurückgehen und dir andere Aufgaben anschauen:",
  "completed-exercise-series": "Glückwunsch, das war die letzte Aufgabe in dieser Serie. Du kannst nun zur Aufgabenübersicht zurückkehren.",
  "exit-exercise-home": "Möchtest du die Aufgabe wirklich verlassen und zum Hauptmenü zurückkehren? Der Zwischenstand kann nicht gespeichert werden.",
  "exit-exercise-view": "Möchtest du die Aufgabe wirklich verlassen und zur Aufgabenübersicht zurückkehren? Der Zwischenstand kann nicht gespeichert werden.",
  "login-text": "Bitte melde Dich an, um an einer Studie teilzunehmen:",
  "login-name": "Benutzername",
  "login-password": "Passwort",
  "construction": "Dieser Inhalt befindet sich momentan noch in Bearbeitung.",
  "flexibility-study": "Studie zum Flexibilitätstraining"
}
