{
    "load-bartering-game": "Lade Tauschhandelspiel",
    "load-substitution-game": "Lade Spiel zum Einsetzungsverfahren",
    "introduction-first-line": "Ein Händler bietet die folgenden Tauschmöglichkeiten an:",
    "description-first-eq": "1. Du kannst {{left}} gegen {{right}} tauschen:",
    "description-sec-eq": "2. Oder {{left}} für {{right}}:",
    "introduction-last-line": "Kannst du aus diesen beiden Gleichungen berechnen, wie viele Münzen der Händler für {{firstVar}} verlangt und wie viele Münzen {{secVar}} wert ist?",
    "substitution-goal": "Betrachte die unteren beiden Gleichungen. Kannst du durch geschicktes Tauschen auf eine Ware in einer der beiden Gleichungen verzichten? Das Ziel ist es, eine neue Gleichung zu formulieren, die nur aus $t({{firstVar}}) und Münzen oder nur aus $t({{secVar}}) und Münzen besteht.",
    "variable-selection": "Wähle die Ware, die du tauschen möchtest, aus:",
    "variable-selection-error-second-var": "Du kannst nur eine Ware tauschen, deren Wert bekannt ist.",
    "variable-selection-error-coin": "Es bringt dich nicht weiter, Münzen gegen Münzen zu tauschen.",
    "variable-selection-error-iso-var": "Deine Idee ist gut, du weißt wie viele {{secVar}} und Münzen {{firstVar}} wert ist. Aber wofür könntest du diese Waren eintauschen? Betrachte die andere Gleichung.",
    "first-substitution-instruction": "Durch welche Waren kannst du {{variable}} ersetzen? Ziehe alle einzutauschenden Waren in das freie Feld.",
    "substitution-error-invalid": "Du kannst $t({{variable}}) nicht mit den ausgewählten Waren ersetzen. Überlege noch einmal, welche Waren du für {{variable}} eintauschen musst.",
    "substitution-error-empty": "Du hast noch keine Waren eingesetzt.",
    "substitution-error-isolated": "Du möchtest eine Gleichung in nur einer Unbekannten erhalten, d. h., es darf $t({{variable}}) enthalten sein.",
    "substitution-error-max-capacity": "Die maximale Anzahl an erlaubten einzusetzenden Waren ist erreicht.",
    "first-substitution-success": "Das ist korrekt! Die $t({{equation}}) Gleichung des Systems",
    "first-substitution-equivalence": "ist äquivalent zu der folgenden Gleichung:",
    "second-variable-question": "Diese Gleichung enthält nur eine Unbekannte. Damit kannst du berechnen, wie viele Münzen {{variable}} wert ist. Weißt du schon die Lösung?",
    "second-variable-value": "Im letzten Schritt hast du berechnet, wie viele Münzen {{variable}} wert ist:",
    "second-substitution-instruction": "Kannst du mit dieser Information berechnen, wie viele Münzen {{firstVar}} kostet? Kannst du durch geschicktes Tauschen in einer der beiden Gleichungen auf {{secVar}} verzichten? Wähle die Ware, die du tauschen möchtest, aus:",
    "coin-substitution": "Tausche die passende Anzahl an Münzen ein:",
    "system-solution-1": "Du hast das Gleichungssystem gelöst. Gut gemacht! Die Lösung des Systems",
    "system-solution-2": "lautet:",
    "hint-first-selection-1": "Überlege welche Variable du durch die andere Variable plus Münzen darstellen kannst.",
    "hint-first-selection-2": "In welcher Gleichung könntest du diese Variable austauschen?",
    "hint-first-selection-3": "Die gesuchte Variable ist {{variable}}.",
    "hint-first-substitution-1": "Ziehe so viele {{variable}} und Münzen wie notwendig in das Feld.",
    "hint-first-substitution-2": "Achte auf Multiplikationsfaktoren. Falls notwending, werden Vorzeichen automatisch angepasst.",
    "hint-first-substitution-3": "Ziehe {{variable}} und {{coins}} in das Feld.",
    "hint-second-selection-1": "Tausche die Variable aus, von der du weißt, wie viele Münzen sie wert ist.",
    "hint-second-selection-2": "Wähle {{variable}} aus.",
    "hint-second-substitution-1": "Ziehe so viele Münzen wie notwendig in das Feld.",
    "hint-second-substitution-2": "Ziehe {{coins}} in das Feld.",
    "substitution-tutorial-title": "Tutorial: Lernspiel zum Einsetzungsverfahren",
    "substitution-tutorial-story-1": "Ein erfahrener Händler muss nicht nur Waren tauschen, sondern auch deren Preise bestimmen können. Die Händler auf dem Mittelmarkt nennen dir verschiedene Tauschoptionen in Form von linearen Gleichungen. Kannst du aus den daraus resultierenden Gleichungssystemen den Preis für eine Ware in Münzen ermitteln?",
    "substitution-tutorial-story-2": "Dieses Spiel soll dir die Idee hinter dem Einsetzungsverfahren vermitteln.\n",
    "substitution-tutorial-general": "Das Lernspiel besteht aus verschiedenen Aufgabenschritten und Ansichten. Jede Interaktion wird auf der entsprechenden Ansicht noch einmal erklärt.",
    "substitution-tutorial-selection": "In einem Aufgabenschritt musst du beispielsweise eine Ware per Klick oder mittels Tippen auswählen, die du (aus-)tauschen möchtest.",
    "substitution-tutorial-hints-button": "Wenn du in einem Schritt nicht weiterkommst, kannst du über den Hinweis-Button einen Tipp erhalten. Versuche möglichst ohne Hinweise, die Aufgabe zu lösen.",
    "substitution-tutorial-substitution": "In einem anderen Aufgabenschritt wirst du Waren via Drag-and-Drop an den Platz der Ware ziehen, die du zuvor zum Austausch ausgewählt hast. Um Waren zu entfernen, reicht es aus, diese wieder aus der Platzhalter-Box zu ziehen.",
    "substitution-tutorial-undo-button": "In manchen Aufgabenschritten kannst du auch zum vorherigen Schritt zurückkehren.",
    "next-exercise": "Du kannst jetzt mit der nächsten Aufgabe fortfahren:",
    "task-sign": "Deine Aufgabe",
    "bartering-description": "Tausche {{left}} für {{right}} ein:",
    "inventory-sign": "Dein Inventar",
    "warning-inventory-full": "Dein Inventar ist bereits voll.",
    "hint-bartering-1": "Welche Waren in deinem Inventar könntest du mit einem Händler tauschen?",
    "hint-bartering-2": "Beachte, dass die Händler eine unterschiedliche Anzahl an Waren zum Tausch benötigen.",
    "hint-bartering-3": "Tausche so lange waren ein, bis du das in der Aufgabenstellung genannte Tauschziel erreicht hast.",
    "bartering-tutorial-title": "Tutorial: Tauschhandel-Spiel",
    "bartering-tutorial-story": "Deine gesamte Klasse macht einen Ausflug zu einem Mittelaltermarkt. Du weißt, dass Bargeld noch kein Begriff im Mittelalter war und stattdessen Waren über Tauschhandel erworben wurden. Die heutige Hauptaktion auf dem Markt ist ein Wettbewerb im Handeln. Wie zu erwarten, hat euer Lehrer euch dazu angemeldet. Kannst du Waren geschickt tauschen und alle Aufgaben lösen?",
    "bartering-tutorial-task": "Deine Aufgabe bzw. dein Tauschziel findest du unten unter dem Abschnitt 'Aufgabe'.",
    "bartering-tutorial-inventory": "In deinem Inventar befinden sich alle Waren, die dir gehören. Du kannst diese Waren mit den oben dargestellten Händlern tauschen. Am Ende des Spiels solltest du alle im Tauschziel genannten Waren in deinem Inventar haben.",
    "bartering-tutorial-merchant": "Der Tauschhandel, den ein Händler anbietet, wird mittels einer Gleichung beschrieben. Auf der linken Seite des Gleichheitszeichens stehen die Waren, die der Händler von dir annehmen würde. Im Gegenzug erhältst du die Waren auf der rechten Seite der Gleichung.",
    "bartering-tutorial-exchange-button": "Um eine Ware mit einem Händler zu tauschen, kannst du diese via Drag-and-Drop aus deinem Inventar in eine der beiden Boxen des Händlers ziehen. Eine Box kann mehrere Waren vom selben Typ beinhalten. Ist ein Tausch mit dem Händler möglich, so färbt sich der Button zum Tauschen von grau zu blau.",
    "bartering-tutorial-undo-redo-buttons": "Die beiden Buttons links unten können verwendet werden, um Aktionen, wie das Tauschen einer Waren mit einem Händler, rückgängig zu machen oder den rückgängig gemachten Zustand wiederherzustellen. Ist ein Button grau, heißt das, dass du die mit dem Button verbundene Aktion gerade nicht durchführen kannst.",
    "bartering-tutorial-hints-button": "Der Hinweis-Button gibt dir allgemeine Tipps zum Spiel."
}
