{
    "about": "About",
    "show-less": "Less",
    "show-more": "More",
    "story": "The project AlgeSPACE emerged from a cooperation with a teacher from a local high school who saw potential in teaching how to solve systems of linear equations computerized. The teacher's students faced struggles with understanding the concepts behind the different methods - equalization, substitution, and elimination - for solving systems of two linear equations in two unknowns. The project seeks innovative approaches to teaching solving systems of linear equations, emphasizing conceptual understanding and enhancing flexibility in problem-solving. The term AlgeSPACE is an abbreviation for 'Algebra Scaffolding with Pedagogical Agents and Concrete Examples'.",
    "usage": "Using AlgeSPACE",
    "usage-description-1": "The educational software is freely available to students and teachers, i.e. it can be used for schools lessons or at home for self-learning without the need for our consent to use it. The usage of the site in the freely accessible programm parts is completely anonymous, we do not track any user data. ",
    "usage-description-2": "If you have any questions or feedback, please do not hesitate to contact us using the contact details below.",
    "research": "Our Research",
    "concept-title": "Interactive Scaffolding with Visual Representations to Foster Conceptual Learning",
    "concept-1": "The provided text books on the topic of linear systems of equations introduce most of the methods either too formally or include confusing visualizations. To tackle this problem, we designed and implemented a short educational software for each of the three strategies mentioned. The design was inspired by the teaching style of the teacher, who likes to explain mathematical concepts in figurative language, drawing analogies to real-life situations. This teaching style is similar to the practices of Realistic Mathematics Education¹ (RME).",
    "concept-2": "RME is an instructional approach that uses realistic and meaningful problem contexts as a starting point for learning mathematics. A core concept of RME is progressive formalization². The term refers to the gradual transition from learning with informal and contextual representations, such as models, to using abstract mathematical reasoning and formal, symbolic language. Models are visual representations of quantities and relations that help students to connect their informal knowledge of the real world to abstract representations of mathematical concepts.",
    "concept-3": "For each of the three methods for solving a linear system, we designed an Intelligent Tutoring System (ITS) that should figuratively explain and mirror the mathematical ideas behind the respective strategy. Each ITS was embedded into a realistic and meaningful problem context. Moreover, we replaced the unknown and abstract variables in the linear equations with visual representations that were relevant to the provided context. Additionally, we incorporated elements of gamification, such as storytelling, visual aesthetics, and challenges, into our design, as they have been observed to positively influence motivation, engagement, and learning outcomes.",
    "agent-title": "Motivational Scaffolding to Support Strategic Learner Choices",
    "agent-1": "Apart from conceptual knowledge, flexibility, characterized as the understanding of various strategies and their relative efficiency, among other factors, has been acknowledged as an important learning objective in this domain. During the Covid-19 pandemic, the learning progress of students has slowed substantially worldwide. It is estimated that in Germany alone, the daily learning time of students was cut in half³. One commonly mentioned explanation is the students' insufficient motivation. In the project AlgeSPACE, we developed an Intelligent Tutoring System (ITS) for training flexibility that deploys pedagogical agents to motivate students and support them in making strategic learning decisions.",
    "agent-2": "Studies have shown that pedagogical agents can facilitate learning with multimedia applications⁴, in which the agents can take on the roles of motivators, mentors and experts. While there has been extensive research on the motivational aspects of pedagogical agents⁵, the impact of pedagogical agents on students' learning behaviours has been less researched. In this project, we aim to develop strategies that encourage students to engage in voluntary exercises that are cognitively demanding yet beneficial. One strategy is the inclusion of pedagogical agents. Another approach involves implementing additional motivational messages based on expectancy-value theory⁶.",
    "agent-3": "Within our learning software, students receive different exercises on solving linear systems. Each exercise includes voluntary tasks, such as explaining the efficiency of particular strategies for a given linear system or to comparing different strategies for the same problem in order to foster flexibility. We aim to explore whether the presence of pedagogical agents and supplementary motivational messages can positively affect students' choice-making behaviours.",
    "team": "Our Team",
    "nagashima-introduction": "The research group of Prof. Dr. Tomohiro Nagashima of the Department of Computer Science with a focus on Technology Enhanced Learning at Saarland University is concerned with human learning behaviour and develops novel learning technologies in cooperation with educators and learners.",
    "bonaventura-introduction": "The website was designed and implemented by Katharina Bonaventura as part of her Master's thesis in the Department of Computer Science at Saarland University. As part of Helene Nüttgens' master's thesis, the learning software was extended with additional functionalities in 2025. With this range of features, AlgeSPACE is also being used in studies on learning can choice-making at schools in several German federal states.",
    "students": "Students"
}
