{
    "post-it-title": "Your Task",
    "post-it-system": "Consider the following system of linear equations:",
    "post-it-task": "Solve the system by adding and subtracting the equations in the table rows. You can also multiply or divide an equation by a constant factor.",
    "button-add-rows": "Add rows",
    "button-sub-rows": "Subtract rows",
    "button-switch-rows": "Swap",
    "switch-label-images": "Show images:",
    "switch-label-fractions": "Show fractions:",
    "instr-add-or-sub-rows": "You can add or subtract the rows from each other at any time:",
    "instr-add-rows": "Select the equations that you want to sum up.",
    "instr-sub-rows": "Select the equations that you want to subtract from each other. Pay attention to the order, the second row you click on is always the subtrahend.",
    "instr-mul-rows": "If you don't want to multiply the equation after all, you can cancel at any time:",
    "instr-div-rows": "If you don't want to divide the equation after all, you can cancel at any time:",
    "instr-max-rows": "The maximum permitted number of rows has been reached. To be able to add or subtract rows again, you must first remove a row.",
    "confirm-add-rows": "You have selected that you want to add the {{first}}. and the {{second}}. row:",
    "confirm-sub-rows": "You have selected that you want to subtract the {{second}}. from the {{first}}. row:",
    "confirm-mul-or-div": "How would you like to proceed with the input?",
    "input-field-validation-error": "Please enter a number unequal to zero, floating-points are allowed. You can also use the following characters to represent fractions or to add terms before $t({{action}}):",
    "input-field-evaluation-error": "This is not a valid expression. ",
    "input-field-range-error": "Unfortunately, at least one of the calculated numbers is too large or too small to be displayed. You seem to have gone astray when calculating. The system of equations has a simpler solution.",
    "input-action-mul": "multiplying",
    "input-action-div": "dividing",
    "input-field-error-instr": "Please correct your entry or cancel the action to return to the previous state:",
    "first-solution": "Well done, you know now how much {{variable}} costs:",
    "first-solution-value": "In the last step, you calculated how much {{variable}} is worth:",
    "substitution-1": "Can you use this information to calculate how much {{variable}} costs? In which of the two equations of the system would you insert the amount of money?",
    "substitution-2": "Choose skilfully so that the calculation effort by hand is low.",
    "good-choice": "That's right. The calculation effort is probably less with the {{count}} equation.",
    "bad-choice": "It would probably cost you less computational effort to insert the solution for {{variable}} into the $t({{count}}) equation. Take another closer look at both equations to understand why you would probably need fewer calculations with the {{count2}} equation.",
    "neutral-choice": "Either of the equations would have been a good choice in this case.",
    "system-solution-1": "The solution of the system",
    "system-solution-2": "is:",
    "hint-1": "Try adding and subtracting lines or multiplying or dividing by a constant factor until you have determined the value of an unknown.",
    "hint-2": "The aim is to obtain a row in which the first column contains a 0 and the second column contains a 1, or vice versa, because then the value of a variable is known.",
    "hint-3": "Try to create a common multiple for one of the variables.",
    "hint-4": "You can also calculate with negative numbers. In the current context, this would mean, for example, that you sell goods instead of buying them.",
    "tutorial-title": "Tutorial: Game on elimination",
    "tutorial-story-1": "You are on holiday in the Caribbean with your family and would like to bring a gift for your friends back home. As your monthly pocket money is not very high, your budget is limited. The local shops offer different deals if you buy several items and/or combine them.",
    "tutorial-story-2": "The offers form a linear system of equations. Can you determine from the system how much a product would cost individually, i.e. whether a purchase is worthwhile for you and whether the offers are really as favourable as they appear at first glance? This educational game is designed to teach the concept of the elimination method.",
    "tutorial-post-it": "You have written down the offer in the form of a system of equations on a post-it note.",
    "tutorial-notebook": "You use a notebook to solve the system of equations. You have heard that systems of equations can be solved particularly skilfully in a table. Now you want to try this out too. Each row in the table represents an equation. In the first two columns of a row, you can see the number of goods that a retailer sells in combination. The last column tells you how much you would pay for these goods together. The table is initially filled with the equations from the system.",
    "tutorial-add-subtract-buttons": "You can use the notebook to add and/or subtract rows in the table or the equations displayed. First select the desired action using the corresponding button.",
    "tutorial-row-selection": "You can then select rows by clicking or tapping on them. If you want to subtract rows from each other, the second selected row is always the subtrahend. However, the order does not matter when adding two rows.",
    "tutorial-subtraction-preview": "As soon as you have selected two rows, the action will also be displayed below using equations. If you are not satisfied with your selection, you can also deselect a row by clicking or tapping on it and then select another row.",
    "tutorial-subtraction-actions": "If you are happy with your selection, you can use the button with the calculator symbol to carry out the addition or subtraction. You can cancel the action using the button with the stop symbol. The previous status of the table is then restored. In subtraction mode, there is also a button labelled 'Swap', which swaps the order of the equations.",
    "tutorial-new-row": "If you add or subtract two rows, the result is written in a new row below. Subtraction can lead to negative numbers, among other things. This is not a problem. The equation shown is still valid and the solution to the system of equations remains the same. In the current context, you can imagine, for example, that you are selling goods instead of buying them.",
    "tutorial-undo-redo-buttons": "You can also undo calculations. To do this, you will find two buttons at the bottom left, one to undo and one to restore the undone status. If a button is greyed out, this means that you cannot currently perform the action associated with the button.",
    "tutorial-copy-delete-buttons": "Alternatively, you can also delete rows. However, the delete action is only possible if there are at least two rows in the table. To delete a row, you must either right-click on it or, if you are using a device with touch, press and hold the row. In this case, a menu will open with the options to delete or copy a row.",
    "tutorial-mul-div-buttons": "Of course, you can also multiply or divide individual rows by constant values.",
    "tutorial-mul-input": "If you select one of the two actions, an input field will appear to the right of the table. Click on this and enter the desired number. It is also possible to offset numbers against each other in the input field, e.g. to add them together and then multiply or divide the row by the result of this addition.",
    "tutorial-mul-error": "If you enter an invalid input, for example letters instead of a number, a warning will be displayed at the bottom and you will not be able to add or divide the row.",
    "tutorial-mul-valid": "If you enter a valid entry, a button with a calculator symbol will appear at the bottom, which you can use to confirm the action and carry out the calculation.",
    "tutorial-mul-result": "In contrast to the addition or subtraction of two rows, no new table row is created when multiplying or dividing a row by a constant. Instead, the result is entered directly into the selected row.",
    "tutorial-images-switch": "The game includes some helps. At the top left you will see two switch or toggle buttons. With the first button you can display the corresponding sum in the form of pictures instead of numbers in the table. Please note that this only applies to whole numbers from 1 to 12.",
    "tutorial-floating-points": "Some calculations may result in floating point numbers.",
    "tutorial-fractions-switch": "The second switch button at the top left allows you to calculate with fractions instead of floating point numbers.",
    "tutorial-hints-button": "The hint button gives you general tips on the game.",
    "tutorial-solution": "You have calculated the solution for a variable or product as soon as the first column of a row contains the number 0 and the second column contains the number 1, or vice versa. The solution is marked directly for you."
}
