{
    "sign-system": "System of equations",
    "sign-task": "Exercise",
    "button-continue": "Yes, continue.",
    "button-explain": "No, please explain.",
    "button-adopt-weight": "Adopt weight as solution",
    "warning-max-capacity": "The maximum capacity of the weighing pan has been reached.",
    "input-field-validation-error": "Please enter a whole number. Valid entries consist of the numbers 0-9. You can also use the following characters to represent fractions or multiply numbers, for example:",
    "input-field-incorrect-input": "Unfortunately, your input is not the sought solution.",
    "feedback-empty-scale": "The scale is in balance, but you are now at an impasse because both variables have disappeared.",
    "feedback-imbalance": "Remember to keep the scale in balance.",
    "feedback-equalization-invalid-balance": "Although the scale is in balance, the equation does not help you to calculate the weight {{variable}}. Take another closer look at the system.",
    "feedback-equalization-invalid-simplification": "Try to only use the basic equalization methode in this step. Do not yet try to simplify the equation." ,
    "feedback-equalization-isolated": "Look at the task again. The aim is to derive an equation without {{variable}}.",
    "feedback-simplification-required": "The given equation can possibly be further simplified.",
    "feedback-simplification-invalid": "The equation shown cannot be created by simplifying the original equation.",
    "feedback-simplification-isolated": "If you want to simplify an equation, you must not add any new variables.",
    "feedback-invalid-weight": "This is not the weight you are looking for. Take a closer look at the system of equations.",
    "instruction-equalization": "Step 1: Can you use the scale below to derive an equation from the system of equations shown at the top left in which $t({{variable}}) is used? Try to keep the scale in balance.",
    "instruction-relation": "That is correct. Take another look at the scale and the original system of equations. Can you see how the two are connected?",
    "instruction-relation-reason": "Each of the two sides of the lower scale can be assigned to exactly one weighing pan of the scales shown in the equation system. The assignment is marked in colour.",
    "instruction-simplification": "Step 2: The equation represented by the scale can be simplified. Simplify the equation so that the scale is still in balance.",
    "instruction-determining-second-variable": "Step 3: You have largely simplified the equation. Can you now tell how much {{variable}} weighs?",
    "instruction-determining-isolated-variable": "Step 4: That's right, {{firstVar}} weighs {{firstWeight}} g. The scale below is now a digital scale that you can use for weighing. Can you now calculate the weight {{secVar}}? At the top left is the original system of equations.",
    "instruction-solution": "You have solved the linear system of equations. Well done! The solution of the system on the top left is given by:",
    "hint-equalization-1": "Can you combine the two scales in the image at the top left so that you get a single scale without {{variable}}?",
    "hint-equalization-2": "Fill the weighing pan(s) with the objects shown in the picture.",
    "hint-equalization-3": "The initial {{firstDir}} weighing pan was or is already filled correctly. You only need to fill the {{secDir}}.",
    "hint-equalization-4a": "Don't modify the {{firstDir}} side of the scale. Fill the {{secDir}} side with the objects that can be seen at the top left in the system of equations on the {{dirScaleImage}} pan of the {{count}} scale. Also pay attention to the number of {{variable}}.",
    "hint-equalization-4b": "Fill one side of the lower scale with the objects that can be seen at the top left of the equation system on the {{dirFirstImage}} pan of the first scale and the other side with the objects on the {{dirSecImage}} pan of the second scale shown. Also pay attention to the number of {{variable}}.",
    "hint-simplification-1": "Is there an object on one of the scales that can also be found on the other scale?",
    "hint-simplification-2a": "Remove {{weight}} grams and {{variable}} from both sides of the original equation.",
    "hint-simplification-2b": "Remove {{weight}} grams from both sides of the original equation.",
    "hint-simplification-2c": "Remove {{variable}} from both sides of the original equation.",
    "hint-determining-second-variable-1": "Divide the total weight by the number of {{variable}}.",
    "hint-determining-second-variable-2": "You can use the input field like a calculator, for example to divide two numbers.",
    "hint-determining-second-variable-3": "Divide {{firstCount}} by {{secCount}}.",
    "hint-determining-second-variable-4": "{{firstCount}} divided by {{secCount}} is {{thirdCount}}.",
    "hint-determining-isolated-variable-1": "Look at the system on the top left again.",
    "hint-determining-isolated-variable-2": "How many {{firstVar}} and/or which weights do you need to mimic the weight of {{secVar}}?",
    "tutorial-title": "Tutorial: Game on equalization",
    "tutorial-story-1": "Your parents have asked you to help them with their weekly shopping: All the fruit and vegetables on the shopping list are still missing. So you make your way to the fruit and vegetable section of your local supermarket.",
    "tutorial-story-2": "But something seems to be wrong with the supermarket's digital scales; you simply can't weigh any fruit directly. You ask an employee for help. According to the employee, the digital scales only work for certain items. The ones you don't need to buy, of course.",
    "tutorial-story-3": "The employee suggests that you use a manual scale instead. But even this is not as easy as you thought, as not every fruit and vegetable has the right weight. With a little effort, you have managed to derive various equations and weight ratios using the manual scales. Can you calculate the weight for a particular item from the resulting equation systems?",
    "tutorial-story-4": "In this game, you will learn how to solve systems of equations visually using manual balances. This knowledge will help you to better understand the basic idea of the equalization method for solving systems of linear equations.",
    "tutorial-instruction": "To solve a system of linear equations, various subtasks or sub-steps of the solution procedure must be completed in the game. You can always see the task associated with the current step in the top right-hand corner.",
    "tutorial-scale": "In most steps, you will work with the scale shown below. The scale has two weighing pans on which you can place objects. The scale reflects the weight ratio of the objects placed on both weighing pans. In addition, the scales are equipped with a display that expresses the weight ratio of the scales as an equation or inequality. In some tasks, there are already initial objects on the scales.",
    "tutorial-items": "You can drag and drop the fruit and/or vegetables shown in the displays on the left and the weights placed on the shelf onto the scales. Please note, however, that there is only a limited quantity for each item. Furthermore, the weights can vary with each task. If you want to remove an item from the scales, simply drag it off the scales and release it in the room. The item is automatically added back to the stock.",
    "tutorial-system": "The system of equations to be solved can be seen at the top left of each task step. Each of the two equations of the system is also visualised with a scale.",
    "tutorial-undo-redo-buttons": "The two buttons at the bottom left can be used to undo actions, such as placing an item on the scales, or to restore the undone state. If a button is greyed out, this means that you cannot currently perform the action associated with the button.",
    "tutorial-hints-button": "If you get stuck in a step, you can get a hint via the hint button. If possible, try to solve the task without any hints.",
    "tutorial-verify-button": "You can check your solution with the button next to the hint button."
}
