{
  "button-continue": "Continue",
  "button-verify-solution": "Verify solution",
  "button-show-solution": "Show solution",
  "button-verify-answer": "Verify answer",
  "button-cancel": "Cancel",
  "button-apply": "Apply",
  "button-insert": "Enter",
  "button-next-exercise": "Next exercise",
  "button-return": "Return",
  "button-return-home": "Return",
  "button-yes": "Yes",
  "button-no": "No",
  "switch-on": "On",
  "switch-off": "Off",
  "language-de": "German",
  "language-en": "English",
  "about": "About",
  "studies": "Studies",
  "equalization": "Equalization Method",
  "substitution": "Substitution Method",
  "bartering": "Bartering",
  "elimination": " Elimination Method",
  "flexibility-training": "Training Flexibility",
  "project-description-1": "Students often find it challenging to grasp the underlying mathematical principles of the three methods - equalization, substitution, and elimination - for solving a system of two linear equations. Many textbooks on this subject introduce these methods in a formal manner or use confusing visualizations. In the project AlgeSPACE, we developed an Intelligent Tutoring System (ITS) for each of the three strategies. Each ITS figuratively explains and mirrors the mathematical ideas behind the respective strategy and incorporates a meaningful problem context.",
  "project-description-2": "For research purposes, we have developed an ITS for training flexibility in solving formal linear systems. Flexibility can be defined as the ability to apply multiple strategies and to identify which strategies are efficient or particularly useful for solving a given problem. In the exercises, students are supported by various pedagogical agents and have the choice to engage in additional tasks that are beneficial for their learning.",
  "equalization-info": "What does it mean when two expressions or terms are equal? In this unit, you will learn the idea behind the equalization method and how you can use the method in practice - to solve systems of linear equations or, for example, when shopping in the supermarket.",
  "header-equalization-game": "Educational game on equalization",
  "substitution-info": "A trading game teaches you how to trade goods skilfully and therefore serves as ideal preparation for the substitution method. The educational game on the substitution method explains how you can replace variables in an equation with expressions from another equation and playfully illustrates the idea of 'substitution'.",
  "header-bartering-game": "Bartering game",
  "header-substitution-game": "Educational game on substitution",
  "elimination-info": "In the educational game on the elimination method, you will not only learn what the method actually has to do with the term 'elimination' and how you can use the arithmetic laws of addition and subtraction to skilfully eliminate unknown variables from equations, but also in which everyday situations the method could be useful.",
  "header-elimination-game": "Educational game on elimination",
  "flexibility-training-info": "It is not only important to be able to apply the various solution methods with confidence, but also to understand which method is most suitable for which system. These tasks can help students to become more confident and flexible in applying the equalization, substitution and elimination methods.",
  "header-flexibility-training": "Exercises for training flexibility",
  "navigation-exercise": "Exercise",
  "navigation-game": "Educational Game",
  "navigation-training": "Training",
  "exercise-completed": "Completed",
  "tutorial": "Tutorial",
  "tutorial-end": "That's all the information you need to solve a task. It doesn't matter if you can't remember all the information in this tutorial or if you don't fully understand some of the actions. Mistakes are completely normal. The game has been developed so that you can try out everything.",
  "tutorial-end-plain": "You can now return to the task overview or start with the first task:",
  "tutorial-end-study": "You can now return to the task overview and start with the first exercise on the method:",
  "tutorial-previous-instruction": "Previous instruction",
  "tutorial-next-instruction": "Next instruction",
  "tutorial-exercise-overview": "Exercise overview",
  "tutorial-first-exercise": "First exercise",
  "equation-1": "Equation 1",
  "equation-2": "Equation 2",
  "rotate-device": "Please rotate your device.",
  "rotate-device-reason": "The educational game can only be played in landscape format.",
  "unsupported-device": "Unfortunately, we do not currently support the device you are using. Please use a standard tablet, laptop or desktop.",
  "load-next-exercise": "Well done, you have completed the task. Would you like to continue with the next task or return to the task overview?",
  "undefined-exercise-series": "Well done, you have completed the task. You can now go back to the task overview and check out other exercises.",
  "completed-exercise-series": "Congratulations, this was the last task in this series. You can now go back to the task overview:",
  "exit-exercise-home": "Do you really want to leave the task and return to the main menu? The intermediate progress cannot be saved.",
  "exit-exercise-view": "Do you really want to leave the task and return to the overview of exercises? The intermediate status cannot be saved.",
  "login-text": "Please login in order to participate in a study:",
  "login-name": "Username",
  "login-password": "Password",
  "construction": "This content is currently still under construction.",
  "flexibility-study": "Study for Flexibility Training"
}
