{
    "load-bartering-game": "Load bartering game",
    "load-substitution-game": "Load substitution game",
    "introduction-first-line": "A merchant offers the following exchange options:",
    "description-first-eq": "1. You can exchange {{left}} for {{right}}:",
    "description-sec-eq": "2. Or {{left}} for {{right}}:",
    "introduction-last-line": "Can you use these two equations to calculate how many coins the merchant charges for {{firstVar}} and how many coins {{secVar}} is worth?",
    "substitution-goal": "Consider the two equations below. Can you skilfully swap one of the goods in one of the two equations? The aim is to formulate a new equation that consists only of $t({{firstVar}}) and coins or only of $t({{secVar}}) and coins.",
    "variable-selection": "Select the goods you would like to exchange:",
    "variable-selection-error-second-var": "You can only exchange goods whose value is known.",
    "variable-selection-error-coin": "Swapping coins for coins won't get you anywhere.",
    "variable-selection-error-iso-var": "Your idea is good, you know how many {{secVar}} and coins {{firstVar}} is worth. But what could you exchange these goods for? Consider the other equation.",
    "first-substitution-instruction": "Which goods can you replace {{variable}} with? Drag all the goods to be exchanged into the free space. ",
    "substitution-error-invalid": "You cannot replace a $t({{variable}}) with the selected goods. Think again about which goods you need to exchange for a {{variable}}.",
    "substitution-error-empty": "You have not yet placed any goods.",
    "substitution-error-isolated": "You want to obtain an equation with only one unknown, i. e. it must not contain $t({{variable}}).",
    "substitution-error-max-capacity": "The maximum number of permitted goods to be inserted has been reached.",
    "first-substitution-success": "That's right! The $t({{equation}}) equation of the system",
    "first-substitution-equivalence": "is equivalent to the following equation:",
    "second-variable-question": "This equation contains only one unknown. You can use it to calculate how many coins {{variable}} is worth. Do you already know the solution?",
    "second-variable-value": "In the last step, you calculated how many coins {{variable}} is worth:",
    "second-substitution-instruction": "Can you use this information to calculate how many coins {{firstVar}} costs? Can you skilfully swap {{secVar}} in one of the two equations? Choose the goods you want to swap:",
    "coin-substitution": "Exchange the right number of coins:",
    "system-solution-1": "You have solved the linear system of equations. Well done! The solution of the system",
    "system-solution-2": "is given by:",
    "hint-first-selection-1": "Think about which variable you can represent by the other variable plus coins.",
    "hint-first-selection-2": "In which equation could you replace this variable?",
    "hint-first-selection-3": "The sought variable is {{variable}}.",
    "hint-first-substitution-1": "Drag as many {{variable}} and coins as necessary into the field.",
    "hint-first-substitution-2": "Pay attention to multiplication factors. If necessary, signs are automatically adjusted.",
    "hint-first-substitution-3": "Drag {{variable}} und {{coins}} into the field.",
    "hint-second-selection-1": "Exchange the variable you know how many coins it is worth.",
    "hint-second-selection-2": "Select {{variable}}.",
    "hint-second-substitution-1": "Drag as many coins as necessary into the field.",
    "hint-second-substitution-2": "Drag {{coins}} into the field.",
    "substitution-tutorial-title": "Tutorial: Game on substitution",
    "substitution-tutorial-story-1": "An experienced trader must not only be able to exchange goods, but also determine their prices. The traders on the middle market will give you various exchange options in the form of linear equations. Can you use the resulting equation systems to determine the price of a good in coins?",
    "substitution-tutorial-story-2": "This game is designed to give you the idea behind the insertion process.\n",
    "substitution-tutorial-general": "The educational game consists of various task steps and views. Each interaction is explained again on the corresponding view.",
    "substitution-tutorial-selection": "In one task step, for example, you have to click or tap on a product that you want to exchange. ",
    "substitution-tutorial-hints-button": "If you get stuck in a step, you can get a hint via the hint button. If possible, try to solve the task without any hints.",
    "substitution-tutorial-substitution": "In another task step, you will drag and drop goods to the location of the goods you have previously selected for exchange. To remove goods, it is sufficient to pull them out of the placeholder box again.",
    "substitution-tutorial-undo-button": "In some task steps, you can also return to the previous step.",
    "next-exercise": "You can now proceed with the next exercise:",
    "task-sign": "Your Task",
    "bartering-description": "Exchange {{left}} for {{right}}:",
    "inventory-sign": "Your Inventory",
    "warning-inventory-full": "Your inventory is already full.",
    "hint-bartering-1": "Which goods in your inventory could you swap with a merchant?",
    "hint-bartering-2": "Note that the merchants require a different number of goods to exchange.",
    "hint-bartering-3": "Keep swapping goods until you have reached the swap target specified in the task.",
    "bartering-tutorial-title": "Tutorial: Game on bartering",
    "bartering-tutorial-story": "Your whole class goes on a trip to a medieval market. You know that cash was not yet a concept in the Middle Ages and that goods were acquired through bartering instead. Today's main activity at the market is a bartering competition. As you might expect, your teacher has registered you for this. Can you trade goods skilfully and solve all the tasks?",
    "bartering-tutorial-task": "You can find your task or exchange target below under the 'Task' section.",
    "bartering-tutorial-inventory": "Your inventory contains all the goods that belong to you. You can exchange these goods with the merchants shown above. At the end of the game, you should have all the goods listed in the exchange objective in your inventory.",
    "bartering-tutorial-merchant": "The barter offered by a trader is described using an equation. On the left-hand side of the equals sign are the goods that the trader would accept from you. In return, you receive the goods on the right-hand side of the equation.",
    "bartering-tutorial-exchange-button": "To exchange a product with a trader, you can drag and drop it from your inventory into one of the trader's two boxes. A box can contain several goods of the same type. If an exchange with the merchant is possible, the exchange button turns from grey to blue.",
    "bartering-tutorial-undo-redo-buttons": "The two buttons at the bottom left can be used to undo actions, such as exchanging goods with a merchant, or to restore the undone status. If a button is greyed out, this means that you cannot currently perform the action associated with the button.",
    "bartering-tutorial-hints-button": "The hint button gives you general tips on the game."
}
